git/pro-git-note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-10 二 19:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>《Pro Git》笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="刘尚亮" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">《Pro Git》笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3d4b843">1. 起步</a></li>
<li><a href="#org933487c">2. Git 基础</a></li>
<li><a href="#org96bef46">3. Git 分支</a></li>
<li><a href="#org7951964">4. 服务器上的 git</a></li>
<li><a href="#orge71749d">5. 分布式 Git</a></li>
<li><a href="#org1345904">6. GitHub</a></li>
<li><a href="#org42c1b87">7. Git 工具</a>
<ul>
<li>
<ul>
<li><a href="#org8d9baf0">7.0.1. 删除</a></li>
<li><a href="#org44160a4">7.0.2. 更新</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6bce7f4">8. 自定义 Git</a></li>
<li><a href="#org6c001c3">9. Git 与其他系统</a>
<ul>
<li><a href="#org41ba175">9.1. 迁移到 Git</a>
<ul>
<li><a href="#orgae3e8bb">9.1.1. 准备环境</a></li>
<li><a href="#org40ff5a6">9.1.2. 规范 Subversion</a></li>
<li><a href="#org3177c68">9.1.3. 生成提交者 ID 和邮箱</a></li>
<li><a href="#orgc2af8f3">9.1.4. 转化成 Git 仓库格式</a></li>
<li><a href="#orgd088f8f">9.1.5. 添加远程仓库</a></li>
<li><a href="#orgf1b5c25">9.1.6. 传所有分支与标签</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org33c2a03">10. Git 内部原理</a></li>
<li><a href="#orgfe0b413">11. Tips</a>
<ul>
<li><a href="#org41a87b1">11.1. Git 代码管理中 .gitignore 文件无效的解决方法</a></li>
<li><a href="#org7270921">11.2. 使用 bcompare 作为 diff、merge 工具</a>
<ul>
<li><a href="#orgc8fde9f">11.2.1. Diff</a></li>
<li><a href="#org0b16e38">11.2.2. Merge</a></li>
<li><a href="#org58165c4">11.2.3. 中文路径乱码</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
这篇文章主要根据《<a href="https://git-scm.com/book/zh/v2">Pro Git 2nd</a>》中文版来记录 GIT 的实践过程。
</p>

<div id="outline-container-org3d4b843" class="outline-2">
<h2 id="org3d4b843"><span class="section-number-2">1</span> 起步</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>git 记录的是快照而不是文件差异，为什么这么做？（这样对于分支管理有益处）这样 git 文件夹会不会很大？</li>
<li>git 使用哈希值来引用文件。</li>
</ol>
</div>
</div>

<div id="outline-container-org933487c" class="outline-2">
<h2 id="org933487c"><span class="section-number-2">2</span> Git 基础</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>git init 与 git init &#x2013;bare 的区别？</li>
<li>了解 git status -s 命令所有标记。</li>
<li>git diff 本身只显示尚未暂存的改动。使用 git diff &#x2013;staged 查看已经暂存的改动。</li>
<li>git commit -v -a -m 选项。</li>
<li>git rm &#x2013;cached 只是将文件从仓库删除，不删除磁盘文件。</li>
<li>git log
<ul class="org-ul">
<li>-p 按补丁形式显示每个更新之间的差异</li>
<li>-&lt;n&gt; 显示最近 n 次提交。</li>
<li>&#x2013;stat 选项显示每次被修改的文件。</li>
<li>&#x2013;pretty 修改显示日志打印的格式。</li>
<li>&#x2013;graph 显示分支、合并历史。</li>
<li>&#x2013;since &#x2013;after &#x2013;before &#x2013;until 按照时间过滤。</li>
<li>&#x2013;S 添加或者移除摸个关键字的提交。</li>
<li>&#x2013; &lt;path&gt; 指定某路径、文件的提交历史。</li>
<li>&#x2013;author 指定作者。</li>
</ul></li>
<li>git commit &#x2013;amend 会用第二次提交的结果替代第一次。</li>
<li>git reset HEAD &lt;file&gt; 来取消暂存。</li>
<li>git checkout &#x2013; &lt;file&gt; 来取消文件所做的修改。</li>
<li>git remote show, add, rm, rename</li>
<li>git tag
<ul class="org-ul">
<li>git push origin &lt;tagname&gt;</li>
<li>git checkout -b &lt;branch&gt; &lt;tagname&gt;</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org96bef46" class="outline-2">
<h2 id="org96bef46"><span class="section-number-2">3</span> Git 分支</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>git 三种对象：blob 对象（保存文件快照），树对象（记录目录结构和 blob 对象索引），提交对象（包含树对象指针和所有提交信息）。</li>
<li>git branch -d &lt;branch&gt; 删除分支。-D 删除还没有合并的分支。</li>
<li>git branch -v 查看每个分支的最后一次提交。</li>
<li>git brach &#x2013;no-merged 查看还没有合并的分支。</li>
<li>本地 master 跟踪远程分支 origin/master</li>
<li>git push &lt;local-branch&gt; &lt;remote/branch&gt; 将本地分支推送到远程分支。</li>
<li>git checkout &lt;local-branch&gt; &lt;remote/branch&gt; 将远程分支拉取到本地分支。</li>
<li>git push &lt;rep&gt; &#x2013;delete &lt;branch&gt; 删除远程分支。</li>
<li>变基的目的是为了确保在向远程分支推送时能保持提交历史的整洁。</li>
<li>git rebase &#x2013;onto</li>
<li>变基的原则：只对尚未推送或分享给别人的本地修改执行变基操作清理历史，从不对已推送至别处的提交执行变基操作，</li>
</ol>
</div>
</div>

<div id="outline-container-org7951964" class="outline-2">
<h2 id="org7951964"><span class="section-number-2">4</span> 服务器上的 git</h2>
</div>

<div id="outline-container-orge71749d" class="outline-2">
<h2 id="orge71749d"><span class="section-number-2">5</span> 分布式 Git</h2>
</div>

<div id="outline-container-org1345904" class="outline-2">
<h2 id="org1345904"><span class="section-number-2">6</span> GitHub</h2>
</div>

<div id="outline-container-org42c1b87" class="outline-2">
<h2 id="org42c1b87"><span class="section-number-2">7</span> Git 工具</h2>
<div class="outline-text-2" id="text-7">
<ol class="org-ol">
<li>git stash 暂存</li>
<li>git clean清理所有未跟踪的文件和目录。经常使用-n先了解一下会删除哪些。</li>
<li>git log -L 打印某个函数的历史。</li>
</ol>
</div>

<div id="outline-container-org8d9baf0" class="outline-4">
<h4 id="org8d9baf0"><span class="section-number-4">7.0.1</span> 删除</h4>
<div class="outline-text-4" id="text-7-0-1">
<ul class="org-ul">
<li>删除 .gitsubmodule 中对应 submodule 的条目</li>
<li>删除 .git/config 中对应 submodule 的条目</li>
<li>执行 git rm &#x2013;cached {submodule_path}。注意，路径不要加后面的 “/”。例如：你的 submodule 保存在 supports/libs/websocket/ 目录。执行命令为：git rm &#x2013;cached supports/libs/websocket</li>
</ul>
</div>
</div>

<div id="outline-container-org44160a4" class="outline-4">
<h4 id="org44160a4"><span class="section-number-4">7.0.2</span> 更新</h4>
<div class="outline-text-4" id="text-7-0-2">
<ul class="org-ul">
<li>更新 .gitsubmodule 中对应 submodule 的条目 URL</li>
<li>更新 .git/config 中对应 submodule 的条目的 URL</li>
<li>执行 git submodule sync</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6bce7f4" class="outline-2">
<h2 id="org6bce7f4"><span class="section-number-2">8</span> 自定义 Git</h2>
</div>
<div id="outline-container-org6c001c3" class="outline-2">
<h2 id="org6c001c3"><span class="section-number-2">9</span> Git 与其他系统</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org41ba175" class="outline-3">
<h3 id="org41ba175"><span class="section-number-3">9.1</span> 迁移到 Git</h3>
<div class="outline-text-3" id="text-9-1">
<p>
这小节主要描述在公司如何代码库从 SVN 迁移到 Git，并保留原有的 commit log 信息，以及迁移过程中要注意的事情。迁移步骤：<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>
</div>
<div id="outline-container-orgae3e8bb" class="outline-4">
<h4 id="orgae3e8bb"><span class="section-number-4">9.1.1</span> 准备环境</h4>
<div class="outline-text-4" id="text-9-1-1">
<p>
需要安装对应的软件：
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo aptitude install -y git Subversion git-svn
</pre>
</div>
</div>
</div>
<div id="outline-container-org40ff5a6" class="outline-4">
<h4 id="org40ff5a6"><span class="section-number-4">9.1.2</span> 规范 Subversion<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h4>
<div class="outline-text-4" id="text-9-1-2">
<p>
确认项目的 Subversion 地址：<a href="https://scms.example.com/svn/projects/west/">https://scms.example.com/svn/projects/west/</a>
</p>

<p>
后面统一用 $PROJECT 表示项目的 Subversion 地址。
</p>

<p>
规范项目在 Subversion 的目录结构包含 trunk、branches、tags
</p>
<ul class="org-ul">
<li>branches 和 tags 目录下的分支和标签保持平级，例如：
<ul class="org-ul">
<li>tags/v1.0.0 可以。</li>
<li>tags/1.x/v1.0.0 多了层目录就不可以。</li>
</ul></li>
<li>如果不是平级，以 tags 为例，先执行 svn mv 操作

<ul class="org-ul">
<li><p>
方式 1 - 远程 svn mv
</p>
<div class="org-src-container">
<pre class="src src-sh"> svn mv $<span style="color: #ff8700;">PROJECT</span>/tags/1.x/v1.0.0 $<span style="color: #ff8700;">PROJECT</span>/tags/v1.0.0
</pre>
</div></li>

<li><p>
方式 2 - 本地 svn mv
</p>
<div class="org-src-container">
<pre class="src src-sh"> svn co $<span style="color: #ff8700;">PROJECT</span> west_subversion
 <span style="color: #d18aff;">cd</span> west_subversion
 svn mv tags/1.x/v1.0.0 tags/v1.0.0
</pre>
</div></li>
</ul></li>
</ul>

<p>
最后规范后的目录示例如下：
</p>
<pre class="example">
west
├── trunk
│   ├── docs
│   ├── west
│   ├── setup.py
│   └── README.rst
├── branches
│   ├── hotfix_add_user_error
│   ├── hotfix_issuse_9527
│   ├── feature_unittest4app
│   └── feature_multi_add_user
└── tags
    ├── v1.0.0
    ├── v1.0.1
    ├── v2.0.0
    └── v2.1.0
</pre>
</div>
</div>
<div id="outline-container-org3177c68" class="outline-4">
<h4 id="org3177c68"><span class="section-number-4">9.1.3</span> 生成提交者 ID 和邮箱</h4>
<div class="outline-text-4" id="text-9-1-3">
<p>
在 Subversion 中，每一个人提交时都需要在系统中有一个用户，它会被记录在提交信息内。 如果想要将 Subversion 用户映射到一个更好的 Git 作者数据中，需要一个 Subversion 用户到 Git 用户的映射。 创建一个 users.txt 的文件包含像下面这种格式的映射：
</p>
<pre class="example">
   user1 = First Last Name &lt;email@address.com&gt;
</pre>

<p>
为了获得 SVN 使用的作者名字列表，可以运行：
</p>
<div class="org-src-container">
<pre class="src src-sh">   svn log --xml | grep author | sort -u |  perl -pe <span style="color: #ff4ea3;">'s/.*&gt;(.*?)&lt;.*/$1 = /'</span> &gt; user.txt
</pre>
</div>

<p>
这会将日志输出为 XML 格式，然后保留作者信息行、去除重复、去除 XML 标记。 （很显然这只会在安装了 grep、sort 与 perl 的机器上运行。） 然后，将输出重定向到你的 users.txt 文件中，这样就可以在每一个记录后面加入对应的 Git 用户数据。
我们项目中 实际执行完以后，发现文档中每行格式是这样的：
</p>
<pre class="example">
   user1 =
</pre>

<p>
猜测可能 svn 中没有保留对应的邮箱地址，需要我们来补全，而且，作为第一个迁出项目的人，最好把邮箱地址都换成自己的，这样在后面向 git 提交的时候不会遇到下面的权限问题：
</p>
<pre class="example">
remote: ERROR: In commit 34f414c0ae5dcb8619c7cb568181f9dfa3ccf840
remote: ERROR: committer email address xxx@mail.com
remote: ERROR: does not match your user account.
remote: ERROR:
remote: ERROR: The following addresses are currently registered:
remote: ERROR: xxxx@mail.com
remote: ERROR:
remote: ERROR: To register an email address, please visit:
remote: ERROR: http://10.10.164.250:8080/#/settings/contact
</pre>


<p>
你可以将此文件提供给 git svn 来帮助它更加精确地映射作者数据。 也可以通过传递 <code>--no-metadata</code> 给 clone 与 init 命令，告诉 git svn 不要包括 Subversion 通常会导入的元数据。
迁出项目代码（git-svn)
</p>
<div class="org-src-container">
<pre class="src src-sh">   git svn clone --authors-file=users.txt --no-metadata --stdlayout http://10.10.16.252/code_svn/xl_vip/vip_lixian/trunk/downloader/ris/  des-dir
</pre>
</div>
<ul class="org-ul">
<li><code>--authors-file</code> 是得到的 git log 提交记录映射好提交者的信息</li>
<li><code>--no-metadata</code> 是得到的 git log 不带上对应的 Subversion 信息了，更干净</li>
<li><p>
<code>--stdlayout</code> 是先前准备的按规范目录风格来迁出代码
这样就得到一个已经导入了分支与标签的有效的 Git 仓库。如果出现用户名没有找到，需要更新 user.txt 文件，然后
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #d18aff;">cd</span> des-dir
git svn fetch
</pre>
</div>

<p>
如果项目比较大，可能需要重复上面的命令好几次，知道所有的 svn commit 全被抓取下来。
完成后，svn 的所有 trunk 会被当做新的 git branch，可以通过  <code>git branch -r</code> 进行查看。
</p>

<p>
svn tags 也会当做 branch 导入。
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgc2af8f3" class="outline-4">
<h4 id="orgc2af8f3"><span class="section-number-4">9.1.4</span> 转化成 Git 仓库格式</h4>
<div class="outline-text-4" id="text-9-1-4">
<p>
应当做一些导入后的清理工作。 第一步，你应当清理 git svn 设置的奇怪的引用。 首先移动标签，这样它们就是标签而不是奇怪的远程引用，然后你会移动剩余的分支这样它们就是本地的了。
为了将标签变为合适的 Git 标签，运行
</p>
<div class="org-src-container">
<pre class="src src-sh">      cp -Rf .git/refs/remotes/tags/* .git/refs/tags/
      rm -Rf .git/refs/remotes/tags/
</pre>
</div>


<p>
这会使原来在 remotes/origin/tags/ 里的远程分支引用变成真正的（轻量）标签。
</p>

<p>
接下来，将 refs/remotes 下剩余的引用移动为本地分支：
</p>
<div class="org-src-container">
<pre class="src src-sh">      cp -Rf .git/refs/remotes/* .git/refs/heads/
      rm -Rf .git/refs/remotes/
</pre>
</div>

<p>
现在所有的旧分支都是真正的 Git 分支，并且所有的旧标签都是真正的 Git 标签。下一步是一个将你的服务器添加为远程仓库。
</p>
</div>
</div>
<div id="outline-container-orgd088f8f" class="outline-4">
<h4 id="orgd088f8f"><span class="section-number-4">9.1.5</span> 添加远程仓库</h4>
<div class="outline-text-4" id="text-9-1-5">
<div class="org-src-container">
<pre class="src src-sh">git remote add gerrit gerrit:xl_lixian_ris.git
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf1b5c25" class="outline-4">
<h4 id="orgf1b5c25"><span class="section-number-4">9.1.6</span> 传所有分支与标签<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup></h4>
<div class="outline-text-4" id="text-9-1-6">
<div class="org-src-container">
<pre class="src src-sh">git push gerrit --all
git push gerrit --tags
</pre>
</div>
<p>
现在通过以上漂亮、干净地导入操作，所有分支与标签都应该在新 Git 服务器上。
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org33c2a03" class="outline-2">
<h2 id="org33c2a03"><span class="section-number-2">10</span> Git 内部原理</h2>
</div>

<div id="outline-container-orgfe0b413" class="outline-2">
<h2 id="orgfe0b413"><span class="section-number-2">11</span> Tips</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org41a87b1" class="outline-3">
<h3 id="org41a87b1"><span class="section-number-3">11.1</span> <a href="http://www.ifeegoo.com/git-code-management-dot-gitignore-file-has-no-effect-solution.html">Git 代码管理中 .gitignore 文件无效的解决方法</a></h3>
</div>
<div id="outline-container-org7270921" class="outline-3">
<h3 id="org7270921"><span class="section-number-3">11.2</span> 使用 bcompare 作为 diff、merge 工具<sup><a id="fnr.4" class="footref" href="#fn.4">4</a></sup></h3>
<div class="outline-text-3" id="text-11-2">
<p>
<a href="http://www.scootersoftware.com/index.php">Beyond Compare</a> 官网上的版本目前是 4.+ 版本, 下载直接安装即可。
</p>

<p>
检查 git 的版本, 根据版本的不同选不同的方法进行设置, 本文是基于 Git 2.3+ 版本操作, 2.3 以下的版本可以参考 Beyond Compare 官网上的其他版本控制配置方法。<sup><a id="fnr.5" class="footref" href="#fn.5">5</a></sup>
</p>
</div>

<div id="outline-container-orgc8fde9f" class="outline-4">
<h4 id="orgc8fde9f"><span class="section-number-4">11.2.1</span> Diff</h4>
<div class="outline-text-4" id="text-11-2-1">
<p>
切换到终端:
</p>

<div class="org-src-container">
<pre class="src src-sh">git config --global diff.tool bc3
</pre>
</div>

<p>
当需要比较修改的时候, 在终端中直接输入 git difftool file.ext 就可以唤起 Beyond Compare。
</p>
</div>
</div>

<div id="outline-container-org0b16e38" class="outline-4">
<h4 id="org0b16e38"><span class="section-number-4">11.2.2</span> Merge</h4>
<div class="outline-text-4" id="text-11-2-2">
<p>
切换到终端:
</p>

<div class="org-src-container">
<pre class="src src-sh">git config --global merge.tool bc3
git config --global mergetool.bc3 trustExitCode true
</pre>
</div>

<p>
当代码发生冲突的时候, 在终端中使用 git mergetool &lt;conflict file&gt; 即可唤起 Beyond Compare, 可谓是十分强大.
</p>
</div>
</div>

<div id="outline-container-org58165c4" class="outline-4">
<h4 id="org58165c4"><span class="section-number-4">11.2.3</span> 中文路径乱码</h4>
<div class="outline-text-4" id="text-11-2-3">
<div class="org-src-container">
<pre class="src src-sh">git config --global core.quotepath false
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://pm.readthedocs.org/zh_CN/latest/vcs/git/subversion2git.html">项目如何从 Subversion 迁移到 Git</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.lovelucy.info/codebase-from-svn-to-git-migration-keep-commit-history.html">将代码库从 SVN 迁移至 Git 并保留所有 commit 记录</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.blogjava.net/lishunli/archive/2012/01/15/368562.html">SVN 迁移到 Git 的过程（+ 一些技巧）</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4">4</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.jianshu.com/p/a080c8649015">OSX Git 结合 Beyond Compare 使用</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.5" class="footnum" href="#fnr.5">5</a></sup> <div class="footpara"><p class="footpara">
<a href="http://www.scootersoftware.com/support.php?zz=kb_vcs">Using Beyond Compare with Version Control Systems</a>
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: 刘尚亮</p>
<p class="email">Email: <a href="mailto:phenix3443@gmai.com">phenix3443@gmai.com</a></p>
<p class="date">Created: 2019-09-10 二 19:59</p>
<p class="validation"></p>
</div>
</body>
</html>
